zhao-rui-NB/ES29-R_e-paper/.pack/Nuvoton/NuMicro_DFP.1.3.19/Device/NUC1263/Include/spdh_reg.h
/**************************************************************************//**
 * @file     spdh_reg.h
 * @version  V3.00
 * @brief    SPDH register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __SPDH_REG_H__
#define __SPDH_REG_H__

 /******************************************************************************/
 /*                Device Specific Peripheral registers structures             */
 /******************************************************************************/

 /** @addtogroup REGISTER Control Register

   @{

 */

/*---------------------- SPDH Controller -------------------------*/
/**
    @addtogroup SPD Hub Controller(SPDH)
    Memory Mapped Structure for SPDH Controller
    @{
*/

typedef struct
{
    __IO uint32_t CTL;                   /*!< [0x0000] SPD5 HUB Control Register                                   */
    __IO uint32_t HID;                   /*!< [0x0004] SPD5 HUB HID Register                                       */
    __IO uint32_t BUSRST;                /*!< [0x0008] SPD5 HUB Bus Reset Register                                 */
    __I  uint32_t STS;                   /*!< [0x000c] SPD5 HUB Status Register                                    */
    __IO uint32_t DCTL;                  /*!< [0x0010] SPD5 HUB Local Device Control Register                      */
    __I  uint32_t DSTS;                  /*!< [0x0014] SPD5 HUB Local Device Status Register                       */
    __IO uint32_t INTEN;                 /*!< [0x0018] SPD5 HUB Interrupt Enable Register                          */
    __IO uint32_t INTSTS;                /*!< [0x001C] SPD5 HUB Interrupt Status Register                          */
    __IO uint32_t HSDASW;                /*!< [0x0020] SPD5 HUB HSDA IO Switch Register                            */
    __IO uint32_t HCAP;                  /*!< [0x0024] SPD5 HUB DEVCAP Register                                    */
    __IO uint32_t DCAP;                  /*!< [0x0028] SPD5 HUB Local Device DEVCAP Register                       */
    __I  uint32_t HDEVCTRL0;             /*!< [0x002C] SPD5 HUB DEVCTRL DATA 0 Register                            */
    __I  uint32_t HDEVCTRL1;             /*!< [0x0030] SPD5 HUB DEVCTRL DATA 1 Register                            */
    __IO uint32_t PWRD;                  /*!< [0x0034] SPD5 HUB Power Down Register                                */

} SPDH_T;

/**
    @addtogroup TIMER_CONST TIMER Bit Field Definition
    Constant Definitions for TIMER Controller
    @{
*/

#define SPDH_CTL_HUBEN_Pos                (0)                                               /*!< SPDH_T::CTL: HUBEN Position           */
#define SPDH_CTL_HUBEN_Msk                (0x1ul << SPDH_CTL_HUBEN_Pos)                     /*!< SPDH_T::CTL: HUBEN Mask               */

#define SPDH_CTL_SIRENVAL_Pos             (2)                                               /*!< SPDH_T::CTL: SIRENVAL Position        */
#define SPDH_CTL_SIRENVAL_Msk             (0x1ul << SPDH_CTL_SIRENVAL_Pos)                  /*!< SPDH_T::CTL: SIRENVAL Mask            */

#define SPDH_CTL_PWRWUEN_Pos              (3)                                               /*!< SPDH_T::CTL: PWRWUEN Position         */
#define SPDH_CTL_PWRWUEN_Msk              (0x1ul << SPDH_CTL_PWRWUEN_Pos)                   /*!< SPDH_T::CTL: PWRWUEN Mask             */

#define SPDH_CTL_CRCEN_Pos                (4)                                               /*!< SPDH_T::CTL: CRCEN Position           */
#define SPDH_CTL_CRCEN_Msk                (0x1ul << SPDH_CTL_CRCEN_Pos)                     /*!< SPDH_T::CTL: CRCEN Mask               */

#define SPDH_CTL_BUSRSTEN_Pos             (5)                                               /*!< SPDH_T::CTL: BUSRSTEN Position        */
#define SPDH_CTL_BUSRSTEN_Msk             (0x1ul << SPDH_CTL_BUSRSTEN_Pos)                  /*!< SPDH_T::CTL: BUSRSTEN Mask            */

#define SPDH_CTL_HSDATOEN_Pos             (6)                                               /*!< SPDH_T::CTL: HSDATOEN Position        */
#define SPDH_CTL_HSDATOEN_Msk             (0x1ul << SPDH_CTL_HSDATOEN_Pos)                  /*!< SPDH_T::CTL: HSDATOEN Mask            */

#define SPDH_CTL_EVENTCLR_Pos             (7)                                               /*!< SPDH_T::CTL: EVENTCLR Position        */
#define SPDH_CTL_EVENTCLR_Msk             (0x1ul << SPDH_CTL_EVENTCLR_Pos)                  /*!< SPDH_T::CTL: EVENTCLR Mask            */

#define SPDH_CTL_LSCLPUS_Pos              (8)                                               /*!< SPDH_T::CTL: LSCLPUS Position         */
#define SPDH_CTL_LSCLPUS_Msk              (0x3ul << SPDH_CTL_LSCLPUS_Pos)                   /*!< SPDH_T::CTL: LSCLPUS Mask             */

#define SPDH_CTL_LSDAPUS_Pos              (12)                                              /*!< SPDH_T::CTL: LSDAPUS Position         */
#define SPDH_CTL_LSDAPUS_Msk              (0x3ul << SPDH_CTL_LSDAPUS_Pos)                   /*!< SPDH_T::CTL: LSDAPUS Mask             */

#define SPDH_CTL_PECCLR_Pos               (15)                                              /*!< SPDH_T::CTL: PECCLR Position          */
#define SPDH_CTL_PECCLR_Msk               (0x1ul << SPDH_CTL_PECCLR_Pos)                    /*!< SPDH_T::CTL: PECCLR Mask              */

#define SPDH_CTL_LPUSEL_Pos               (16)                                              /*!< SPDH_T::CTL: LPUSEL Position          */
#define SPDH_CTL_LPUSEL_Msk               (0x3ul << SPDH_CTL_LPUSEL_Pos)                    /*!< SPDH_T::CTL: LPUSEL Mask              */

#define SPDH_HID_HID_Pos                  (0)                                               /*!< SPDH_T::HID: HID Position             */
#define SPDH_HID_HID_Msk                  (0x7ul << SPDH_HID_HID_Pos)                       /*!< SPDH_T::HID: HID Mask                 */

