zhao-rui-NB/ES29-R_e-paper/.pack/Nuvoton/NuMicro_DFP.1.3.19/Device/NUC1263/Include/spdh_reg.h
#define SPDH_BUSRST_BUSTO_Pos             (0)                                               /*!< SPDH_T::BUSRST: BUSTO Position        */
#define SPDH_BUSRST_BUSTO_Msk             (0xfful << SPDH_BUSRST_BUSTO_Pos)                 /*!< SPDH_T::BUSRST: BUSTO Mask            */

#define SPDH_STS_PECSTS_Pos               (0)                                               /*!< SPDH_T::STS: PECSTS Position          */
#define SPDH_STS_PECSTS_Msk               (0x1ul << SPDH_STS_PECSTS_Pos)                    /*!< SPDH_T::STS: PECSTS Mask              */

#define SPDH_STS_PARDIS_Pos               (1)                                               /*!< SPDH_T::STS: PARDIS Position          */
#define SPDH_STS_PARDIS_Msk               (0x1ul << SPDH_STS_PARDIS_Pos)                    /*!< SPDH_T::STS: PARDIS Mask              */

#define SPDH_STS_IBICLR_Pos               (2)                                               /*!< SPDH_T::STS: IBICLR Position          */
#define SPDH_STS_IBICLR_Msk               (0x1ul << SPDH_STS_IBICLR_Pos)                    /*!< SPDH_T::STS: IBICLR Mask              */

#define SPDH_STS_PECCHK_Pos               (4)                                               /*!< SPDH_T::STS: PECCHK Position          */
#define SPDH_STS_PECCHK_Msk               (0x1ul << SPDH_STS_PECCHK_Pos)                    /*!< SPDH_T::STS: PECCHK Mask              */

#define SPDH_STS_MODE_Pos                 (5)                                               /*!< SPDH_T::STS: MODE Position            */
#define SPDH_STS_MODE_Msk                 (0x1ul << SPDH_STS_MODE_Pos)                      /*!< SPDH_T::STS: MODE Mask                */

#define SPDH_STS_IBIHEAD_Pos              (6)                                               /*!< SPDH_T::STS: IBIHEAD Position         */
#define SPDH_STS_IBIHEAD_Msk              (0x1ul << SPDH_STS_IBIHEAD_Pos)                   /*!< SPDH_T::STS: IBIHEAD Mask             */

#define SPDH_STS_PENDIBI_Pos              (8)                                               /*!< SPDH_T::STS: PENDIBI Position         */
#define SPDH_STS_PENDIBI_Msk              (0xful << SPDH_STS_PENDIBI_Pos)                   /*!< SPDH_T::STS: PENDIBI Mask             */

#define SPDH_STS_PROERR_Pos               (12)                                              /*!< SPDH_T::STS: PROERR Position          */
#define SPDH_STS_PROERR_Msk               (0x1ul << SPDH_STS_PROERR_Pos)                    /*!< SPDH_T::STS: PROERR Mask              */

#define SPDH_STS_PECERR_Pos               (13)                                              /*!< SPDH_T::STS: PECERR Position          */
#define SPDH_STS_PECERR_Msk               (0x1ul << SPDH_STS_PECERR_Pos)                    /*!< SPDH_T::STS: PECERR Mask              */

#define SPDH_DCTL_HID_Pos                 (0)                                               /*!< SPDH_T::DCTL: HID Position            */
#define SPDH_DCTL_HID_Msk                 (0x7ul << SPDH_DCTL_HID_Pos)                      /*!< SPDH_T::DCTL: HID Mask                */

#define SPDH_DCTL_LID_Pos                 (3)                                               /*!< SPDH_T::DCTL: LID Position            */
#define SPDH_DCTL_LID_Msk                 (0xful << SPDH_DCTL_LID_Pos)                      /*!< SPDH_T::DCTL: LID Mask                */

#define SPDH_DCTL_EVENTCLR_Pos            (7)                                               /*!< SPDH_T::DCTL: EVENTCLR Position       */
#define SPDH_DCTL_EVENTCLR_Msk            (0x1ul << SPDH_DCTL_EVENTCLR_Pos)                 /*!< SPDH_T::DCTL: EVENTCLR Mask           */

#define SPDH_DCTL_CRCEN_Pos               (8)                                               /*!< SPDH_T::DCTL: CRCEN Position          */
#define SPDH_DCTL_CRCEN_Msk               (0x1ul << SPDH_DCTL_CRCEN_Pos)                    /*!< SPDH_T::DCTL: CRCEN Mask              */

#define SPDH_DCTL_SIRENVAL_Pos            (9)                                               /*!< SPDH_T::DCTL: SIRENVAL Position       */
#define SPDH_DCTL_SIRENVAL_Msk            (0x1ul << SPDH_DCTL_SIRENVAL_Pos)                 /*!< SPDH_T::DCTL: SIRENVAL Mask           */

#define SPDH_DCTL_PECCLR_Pos              (15)                                              /*!< SPDH_T::DCTL: PECCLR Position         */
#define SPDH_DCTL_PECCLR_Msk              (0x1ul << SPDH_DCTL_PECCLR_Pos)                   /*!< SPDH_T::DCTL: PECCLR Mask             */

#define SPDH_DSTS_PECSTS_Pos              (0)                                               /*!< SPDH_T::DSTS: PECSTS Position         */
#define SPDH_DSTS_PECSTS_Msk              (0x1ul << SPDH_DSTS_PECSTS_Pos)                   /*!< SPDH_T::DSTS: PECSTS Mask             */

#define SPDH_DSTS_PARDIS_Pos              (1)                                               /*!< SPDH_T::DSTS: PARDIS Position         */
#define SPDH_DSTS_PARDIS_Msk              (0x1ul << SPDH_DSTS_PARDIS_Pos)                   /*!< SPDH_T::DSTS: PARDIS Mask             */

#define SPDH_DSTS_IBICLR_Pos              (2)                                               /*!< SPDH_T::DSTS: IBICLR Position         */
#define SPDH_DSTS_IBICLR_Msk              (0x1ul << SPDH_DSTS_IBICLR_Pos)                   /*!< SPDH_T::DSTS: IBICLR Mask             */

#define SPDH_DSTS_PECCHK_Pos              (4)                                               /*!< SPDH_T::DSTS: PECCHK Position         */
#define SPDH_DSTS_PECCHK_Msk              (0x1ul << SPDH_DSTS_PECCHK_Pos)                   /*!< SPDH_T::DSTS: PECCHK Mask             */

#define SPDH_DSTS_MODE_Pos                (5)                                               /*!< SPDH_T::DSTS: MODE Position           */
#define SPDH_DSTS_MODE_Msk                (0x1ul << SPDH_DSTS_MODE_Pos)                     /*!< SPDH_T::DSTS: MODE Mask               */

#define SPDH_DSTS_IBIHEAD_Pos             (6)                                               /*!< SPDH_T::DSTS: IBIHEAD Position        */
#define SPDH_DSTS_IBIHEAD_Msk             (0x1ul << SPDH_DSTS_IBIHEAD_Pos)                  /*!< SPDH_T::DSTS: IBIHEAD Mask            */

#define SPDH_DSTS_PENDIBI_Pos             (8)                                               /*!< SPDH_T::DSTS: PENDIBI Position        */
#define SPDH_DSTS_PENDIBI_Msk             (0xful << SPDH_DSTS_PENDIBI_Pos)                  /*!< SPDH_T::DSTS: PENDIBI Mask            */

#define SPDH_DSTS_PROERR_Pos              (12)                                              /*!< SPDH_T::DSTS: PROERR Position         */
#define SPDH_DSTS_PROERR_Msk              (0x1ul << SPDH_DSTS_PROERR_Pos)                   /*!< SPDH_T::DSTS: PROERR Mask             */

#define SPDH_DSTS_PECERR_Pos              (13)                                              /*!< SPDH_T::DSTS: PECERR Position         */
#define SPDH_DSTS_PECERR_Msk              (0x1ul << SPDH_DSTS_PECERR_Pos)                   /*!< SPDH_T::DSTS: PECERR Mask             */

#define SPDH_INTEN_BUSRTOEN_Pos           (0)                                               /*!< SPDH_T::INTEN: BUSRTOEN Position      */
#define SPDH_INTEN_BUSRTOEN_Msk           (0x1ul << SPDH_INTEN_BUSRTOEN_Pos)                /*!< SPDH_T::INTEN: BUSRTOEN Mask          */

#define SPDH_INTEN_HDEVCTLEN_Pos          (1)                                               /*!< SPDH_T::INTEN: HDEVCTLEN Position     */
#define SPDH_INTEN_HDEVCTLEN_Msk          (0x1ul << SPDH_INTEN_HDEVCTLEN_Pos)               /*!< SPDH_T::INTEN: HDEVCTLEN Mask         */

#define SPDH_INTEN_DDEVCTLEN_Pos          (2)                                               /*!< SPDH_T::INTEN: DDEVCTLEN Position     */
#define SPDH_INTEN_DDEVCTLEN_Msk          (0x1ul << SPDH_INTEN_DDEVCTLEN_Pos)               /*!< SPDH_T::INTEN: DDEVCTLEN Mask         */

