zhao-rui-NB/ES29-R_e-paper/.pack/Nuvoton/NuMicro_DFP.1.3.19/Device/NUC1263/Include/spdh_reg.h
#define SPDH_INTEN_HDEVCAPEN_Pos          (3)                                               /*!< SPDH_T::INTEN: HDEVCAPEN Position     */
#define SPDH_INTEN_HDEVCAPEN_Msk          (0x1ul << SPDH_INTEN_HDEVCAPEN_Pos)               /*!< SPDH_T::INTEN: HDEVCAPEN Mask         */

#define SPDH_INTEN_DDEVCAPEN_Pos          (4)                                               /*!< SPDH_T::INTEN: DDEVCAPEN Position     */
#define SPDH_INTEN_DDEVCAPEN_Msk          (0x1ul << SPDH_INTEN_DDEVCAPEN_Pos)               /*!< SPDH_T::INTEN: DDEVCAPEN Mask         */

#define SPDH_INTEN_DSETHIDEN_Pos          (5)                                               /*!< SPDH_T::INTEN: DSETHIDEN Position     */
#define SPDH_INTEN_DSETHIDEN_Msk          (0x1ul << SPDH_INTEN_DSETHIDEN_Pos)               /*!< SPDH_T::INTEN: DSETHIDEN Mask         */

#define SPDH_INTEN_HUBPCEN_Pos            (6)                                               /*!< SPDH_T::INTEN: HUBPCEN Position       */
#define SPDH_INTEN_HUBPCEN_Msk            (0x1ul << SPDH_INTEN_HUBPCEN_Pos)                 /*!< SPDH_T::INTEN: HUBPCEN Mask           */

#define SPDH_INTEN_DEVPCEN_Pos            (7)                                               /*!< SPDH_T::INTEN: DEVPCEN Position       */
#define SPDH_INTEN_DEVPCEN_Msk            (0x1ul << SPDH_INTEN_DEVPCEN_Pos)                 /*!< SPDH_T::INTEN: DEVPCEN Mask           */

#define SPDH_INTEN_HSDATOEN_Pos           (8)                                               /*!< SPDH_T::INTEN: HSDATOEN Position      */
#define SPDH_INTEN_HSDATOEN_Msk           (0x1ul << SPDH_INTEN_HSDATOEN_Pos)                /*!< SPDH_T::INTEN: HSDATOEN Mask          */

#define SPDH_INTEN_HUBIHDEN_Pos           (9)                                               /*!< SPDH_T::INTEN: HUBIHDEN Position      */
#define SPDH_INTEN_HUBIHDEN_Msk           (0x1ul << SPDH_INTEN_HUBIHDEN_Pos)                /*!< SPDH_T::INTEN: HUBIHDEN Mask          */

#define SPDH_INTEN_DEVIHDEN_Pos           (10)                                              /*!< SPDH_T::INTEN: DEVIHDEN Position      */
#define SPDH_INTEN_DEVIHDEN_Msk           (0x1ul << SPDH_INTEN_DEVIHDEN_Pos)                /*!< SPDH_T::INTEN: DEVIHDEN Mask          */

#define SPDH_INTEN_PWRDTOEN_Pos           (11)                                              /*!< SPDH_T::INTEN: PWRDTOEN Position      */
#define SPDH_INTEN_PWRDTOEN_Msk           (0x1ul << SPDH_INTEN_PWRDTOEN_Pos)                /*!< SPDH_T::INTEN: PWRDTOEN Mask          */

#define SPDH_INTEN_WKUPEN_Pos             (12)                                              /*!< SPDH_T::INTEN: WKUPEN Position        */
#define SPDH_INTEN_WKUPEN_Msk             (0x1ul << SPDH_INTEN_WKUPEN_Pos)                  /*!< SPDH_T::INTEN: WKUPEN Mask            */

#define SPDH_INTSTS_BUSRTOIF_Pos          (0)                                               /*!< SPDH_T::INTSTS: BUSRTOIF Position     */
#define SPDH_INTSTS_BUSRTOIF_Msk          (0x1ul << SPDH_INTSTS_BUSRTOIF_Pos)               /*!< SPDH_T::INTSTS: BUSRTOIF Mask         */

#define SPDH_INTSTS_HDEVCTLIF_Pos         (1)                                               /*!< SPDH_T::INTSTS: HDEVCTLIF Position    */
#define SPDH_INTSTS_HDEVCTLIF_Msk         (0x1ul << SPDH_INTSTS_HDEVCTLIF_Pos)              /*!< SPDH_T::INTSTS: HDEVCTLIF Mask        */

#define SPDH_INTSTS_DDEVCTLIF_Pos         (2)                                               /*!< SPDH_T::INTSTS: DDEVCTLIF Position    */
#define SPDH_INTSTS_DDEVCTLIF_Msk         (0x1ul << SPDH_INTSTS_DDEVCTLIF_Pos)              /*!< SPDH_T::INTSTS: DDEVCTLIF Mask        */

#define SPDH_INTSTS_HDEVCAPIF_Pos         (3)                                               /*!< SPDH_T::INTSTS: HDEVCAPIF Position    */
#define SPDH_INTSTS_HDEVCAPIF_Msk         (0x1ul << SPDH_INTSTS_HDEVCAPIF_Pos)              /*!< SPDH_T::INTSTS: HDEVCAPIF Mask        */

#define SPDH_INTSTS_DDEVCAPIF_Pos         (4)                                               /*!< SPDH_T::INTSTS: DDEVCAPIF Position    */
#define SPDH_INTSTS_DDEVCAPIF_Msk         (0x1ul << SPDH_INTSTS_DDEVCAPIF_Pos)              /*!< SPDH_T::INTSTS: DDEVCAPIF Mask        */

#define SPDH_INTSTS_DSETHIDIF_Pos         (5)                                               /*!< SPDH_T::INTSTS: DSETHIDIF Position    */
#define SPDH_INTSTS_DSETHIDIF_Msk         (0x1ul << SPDH_INTSTS_DSETHIDIF_Pos)              /*!< SPDH_T::INTSTS: DSETHIDIF Mask        */

#define SPDH_INTSTS_HUBPCIF_Pos           (6)                                               /*!< SPDH_T::INTSTS: HUBPCIF Position      */
#define SPDH_INTSTS_HUBPCIF_Msk           (0x1ul << SPDH_INTSTS_HUBPCIF_Pos)                /*!< SPDH_T::INTSTS: HUBPCIF Mask          */

#define SPDH_INTSTS_DEVPCIF_Pos           (7)                                               /*!< SPDH_T::INTSTS: DEVPCIF Position      */
#define SPDH_INTSTS_DEVPCIF_Msk           (0x1ul << SPDH_INTSTS_DEVPCIF_Pos)                /*!< SPDH_T::INTSTS: DEVPCIF Mask          */

#define SPDH_INTSTS_HSDATOIF_Pos          (8)                                               /*!< SPDH_T::INTSTS: HSDATOIF Position     */
#define SPDH_INTSTS_HSDATOIF_Msk          (0x1ul << SPDH_INTSTS_HSDATOIF_Pos)               /*!< SPDH_T::INTSTS: HSDATOIF Mask         */

#define SPDH_INTSTS_HUBIHDIF_Pos          (9)                                               /*!< SPDH_T::INTSTS: HUBIHDIF Position     */
#define SPDH_INTSTS_HUBIHDIF_Msk          (0x1ul << SPDH_INTSTS_HUBIHDIF_Pos)               /*!< SPDH_T::INTSTS: HUBIHDIF Mask         */

#define SPDH_INTSTS_DEVIHDIF_Pos          (10)                                              /*!< SPDH_T::INTSTS: DEVIHDIF Position     */
#define SPDH_INTSTS_DEVIHDIF_Msk          (0x1ul << SPDH_INTSTS_DEVIHDIF_Pos)               /*!< SPDH_T::INTSTS: DEVIHDIF Mask         */

#define SPDH_INTSTS_PWRDTOIF_Pos          (11)                                              /*!< SPDH_T::INTSTS: PWRDTOIF Position     */
#define SPDH_INTSTS_PWRDTOIF_Msk          (0x1ul << SPDH_INTSTS_PWRDTOIF_Pos)               /*!< SPDH_T::INTSTS: PWRDTOIF Mask         */

#define SPDH_INTSTS_WKUPIF_Pos            (12)                                              /*!< SPDH_T::INTSTS: WKUPIF Position       */
#define SPDH_INTSTS_WKUPIF_Msk            (0x1ul << SPDH_INTSTS_WKUPIF_Pos)                 /*!< SPDH_T::INTSTS: WKUPIF Mask           */

#define SPDH_HSDASW_IOSWTO_Pos            (0)                                               /*!< SPDH_T::HSDASW: IOSWTO Position       */
#define SPDH_HSDASW_IOSWTO_Msk            (0x3ful << SPDH_HSDASW_IOSWTO_Pos)                /*!< SPDH_T::HSDASW: IOSWTO Mask           */

