zhao-rui-NB/ES29-R_e-paper/.pack/Nuvoton/NuMicro_DFP.1.3.19/Device/NUC1263/Include/spdh_reg.h
#define SPDH_HCAP_LSB_Pos                 (0)                                               /*!< SPDH_T::HCAP: LSB Position            */
#define SPDH_HCAP_LSB_Msk                 (0xfful << SPDH_HCAP_LSB_Pos)                     /*!< SPDH_T::HCAP: LSB Mask                */

#define SPDH_HCAP_MSB_Pos                 (8)                                               /*!< SPDH_T::HCAP: MSB Position            */
#define SPDH_HCAP_MSB_Msk                 (0xfful << SPDH_HCAP_MSB_Pos)                     /*!< SPDH_T::HCAP: MSB Mask                */

#define SPDH_DCAP_LSB_Pos                 (0)                                               /*!< SPDH_T::DCAP: LSB Position            */
#define SPDH_DCAP_LSB_Msk                 (0xfful << SPDH_DCAP_LSB_Pos)                     /*!< SPDH_T::DCAP: LSB Mask                */

#define SPDH_DCAP_MSB_Pos                 (8)                                               /*!< SPDH_T::DCAP: MSB Position            */
#define SPDH_DCAP_MSB_Msk                 (0xfful << SPDH_DCAP_MSB_Pos)                     /*!< SPDH_T::DCAP: MSB Mask                */

#define SPDH_HDEVCTRL0_REGMOD_Pos         (0)                                               /*!< SPDH_T::HDEVCTRL0: REGMOD Position    */
#define SPDH_HDEVCTRL0_REGMOD_Msk         (0x1ul << SPDH_HDEVCTRL0_REGMOD_Pos)              /*!< SPDH_T::HDEVCTRL0: REGMOD Mask        */

#define SPDH_HDEVCTRL0_PECBL_Pos          (1)                                               /*!< SPDH_T::HDEVCTRL0: PECBL Position     */
#define SPDH_HDEVCTRL0_PECBL_Msk          (0x3ul << SPDH_HDEVCTRL0_PECBL_Pos)               /*!< SPDH_T::HDEVCTRL0: PECBL Mask         */

#define SPDH_HDEVCTRL0_STAOFSET_Pos       (3)                                               /*!< SPDH_T::HDEVCTRL0: STAOFSET Position  */
#define SPDH_HDEVCTRL0_STAOFSET_Msk       (0x3ul << SPDH_HDEVCTRL0_STAOFSET_Pos)            /*!< SPDH_T::HDEVCTRL0: STAOFSET Mask      */

#define SPDH_HDEVCTRL0_ADDRMSK_Pos        (5)                                               /*!< SPDH_T::HDEVCTRL0: ADDRMSK Position   */
#define SPDH_HDEVCTRL0_ADDRMSK_Msk        (0x7ul << SPDH_HDEVCTRL0_ADDRMSK_Pos)             /*!< SPDH_T::HDEVCTRL0: ADDRMSK Mask       */

#define SPDH_HDEVCTRL0_DEVID_Pos          (9)                                               /*!< SPDH_T::HDEVCTRL0: DEVID Position     */
#define SPDH_HDEVCTRL0_DEVID_Msk          (0x7ful << SPDH_HDEVCTRL0_DEVID_Pos)              /*!< SPDH_T::HDEVCTRL0: DEVID Mask         */

#define SPDH_HDEVCTRL1_PAYLOAD0_Pos       (0)                                               /*!< SPDH_T::HDEVCTRL1: PAYLOAD0 Position  */
#define SPDH_HDEVCTRL1_PAYLOAD0_Msk       (0xfful << SPDH_HDEVCTRL1_PAYLOAD0_Pos)           /*!< SPDH_T::HDEVCTRL1: PAYLOAD0 Mask      */

#define SPDH_HDEVCTRL1_PAYLOAD1_Pos       (8)                                               /*!< SPDH_T::HDEVCTRL1: PAYLOAD1 Position  */
#define SPDH_HDEVCTRL1_PAYLOAD1_Msk       (0xfful << SPDH_HDEVCTRL1_PAYLOAD1_Pos)           /*!< SPDH_T::HDEVCTRL1: PAYLOAD1 Mask      */

#define SPDH_HDEVCTRL1_PAYLOAD2_Pos       (16)                                              /*!< SPDH_T::HDEVCTRL1: PAYLOAD2 Position  */
#define SPDH_HDEVCTRL1_PAYLOAD2_Msk       (0xfful << SPDH_HDEVCTRL1_PAYLOAD2_Pos)           /*!< SPDH_T::HDEVCTRL1: PAYLOAD2 Mask      */

#define SPDH_HDEVCTRL1_PAYLOAD3_Pos       (24)                                              /*!< SPDH_T::HDEVCTRL1: PAYLOAD3 Position  */
#define SPDH_HDEVCTRL1_PAYLOAD3_Msk       (0xfful << SPDH_HDEVCTRL1_PAYLOAD3_Pos)           /*!< SPDH_T::HDEVCTRL1: PAYLOAD3 Mask      */

#define SPDH_PWRD_PWRDTO_Pos              (0)                                               /*!< SPDH_T::PWRD: PWRDTO Position         */
#define SPDH_PWRD_PWRDTO_Msk              (0xfful << SPDH_PWRD_PWRDTO_Pos)                  /*!< SPDH_T::PWRD: PWRDTO Mask             */


/**@}*/ /* SPDH_CONST */
/**@}*/ /* end of SPDH register group */
/**@}*/ /* end of REGISTER group */

#endif /* __SPDH_REG_H__ */
